package Array;

public class Array {
    //变量类型 变量名字 = 变量的值
    //数组类型

    public static void main(String[] args) {
        int[] nums1; //1. 声明了该数组

        int nums2[]; //这个是C/C++里面的
        //效果一样但是更推荐第一个，因为Java建议在类型后面加[]代表数组
        //先定义后使用

        nums1 = new int[10];//2.创建一个数组

        //这里面可以存放10个int类型的数字
        //arraySize可以是变量

        //3.给数组元素中赋值
        nums1[0] = 1;
        nums1[1] = 10;
        nums1[2] = 20;
        nums1[3] = 30;
        nums1[4] = 40;
        nums1[5] = 50;
        nums1[6] = 60;
        nums1[7] = 70;
        nums1[8] = 80;
//        nums1[9] = 90;

        System.out.println(nums1[10]);
        //如果要输出的序列号那个没有值，会输出默认值0
    }
}
/*
框框代表内存空间

如果是int话一个框框只能放一个数字，若想放多个数字就要多个框框

而且这是一个二维数组

数组的这个只是定义长度

int x = 1                 int nums = new int[4]
                          |------------------|
|-----|                   | |-----|  |-----| |
|  1  |                   | |  2  |  |  4  | |
|-----|                   | |-----|  |-----| |
                          |   [0]      [1]   |
                          | |-----|  |-----| |
                          | |  6  |  |  5  | |
                          | |-----|  |-----| |
                          |   [2]      [3]   |
                          |------------------|
                                   nums


默认值
boolean         false
char            '/uoooo'(null)
byte            (byte)0
short           (short)0
int             0
long            0L
float           0.0f
double          0.0d

null是所有引用类型的默认值。


写代码画图分析内存
|`````````|         |``````````````````````````|
|         |         | |```| |```| |```| |```|  |
| |`````| |         | | 0 | | 0 | | 0 | | 0 |  |
| |array| |      ↗--->|___| |___| |___| |___|  |
| ```↓````|     ↗   |  [0]   [1]   [2]   [3]   |
|    ↘ ---|---↗     ````````````````````````````
|.........|             array = new int[4]
   stack

int[] array=null
 */